scc2425-artillery-tests/benchmark_logs/benchmark_log_targetdesc_Kubernets_Final_test_1_20241213_201645.txt
Running user_register.yaml on http://127.0.0.1:8080/tukano-1/rest
Test run id: tebwn_ctxhbz67m85w9zc3etwxdjxyrcmqj_w96y
Phase started: simple_post (index: 0, duration: 20s) 20:16:46(+0000)

--------------------------------------
Metrics for period to: 20:16:50(+0000) (width: 2.901s)
--------------------------------------

http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 30


--------------------------------------
Metrics for period to: 20:17:00(+0000) (width: 9.901s)
--------------------------------------

http.codes.200: ................................................................ 387
http.downloaded_bytes: ......................................................... 41487
http.request_rate: ............................................................. 36/sec
http.requests: ................................................................. 358
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 9019
  mean: ........................................................................ 795.9
  median: ...................................................................... 36.2
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 7557.1
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 9019
  mean: ........................................................................ 795.9
  median: ...................................................................... 36.2
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 7557.1
http.responses: ................................................................ 387
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.200: ................... 129
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  129
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  129
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 10
  max: ......................................................................... 9019
  mean: ........................................................................ 2267.9
  median: ...................................................................... 172.5
  p95: ......................................................................... 7260.8
  p99: ......................................................................... 8186.6
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 4
  max: ......................................................................... 261
  mean: ........................................................................ 65.3
  median: ...................................................................... 21.1
  p95: ......................................................................... 228.2
  p99: ......................................................................... 242.3
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 3
  max: ......................................................................... 308
  mean: ........................................................................ 54.6
  median: ...................................................................... 21.1
  p95: ......................................................................... 232.8
  p99: ......................................................................... 278.7
vusers.completed: .............................................................. 129
vusers.created: ................................................................ 100
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 23.6
  max: ......................................................................... 9158.7
  mean: ........................................................................ 2393.1
  median: ...................................................................... 441.5
  p95: ......................................................................... 7260.8
  p99: ......................................................................... 8186.6


Phase completed: simple_post (index: 0, duration: 20s) 20:17:06(+0000)

--------------------------------------
Metrics for period to: 20:17:10(+0000) (width: 7.414s)
--------------------------------------

http.codes.200: ................................................................ 213
http.downloaded_bytes: ......................................................... 22647
http.request_rate: ............................................................. 29/sec
http.requests: ................................................................. 212
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 655
  mean: ........................................................................ 25.1
  median: ...................................................................... 7
  p95: ......................................................................... 133
  p99: ......................................................................... 383.8
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 655
  mean: ........................................................................ 25.1
  median: ...................................................................... 7
  p95: ......................................................................... 133
  p99: ......................................................................... 383.8
http.responses: ................................................................ 213
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.200: ................... 71
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  71
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  71
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 8
  max: ......................................................................... 655
  mean: ........................................................................ 45.1
  median: ...................................................................... 10.9
  p95: ......................................................................... 278.7
  p99: ......................................................................... 584.2
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 4
  max: ......................................................................... 364
  mean: ........................................................................ 14
  median: ...................................................................... 6
  p95: ......................................................................... 18
  p99: ......................................................................... 135.7
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 3
  max: ......................................................................... 288
  mean: ........................................................................ 16.2
  median: ...................................................................... 4
  p95: ......................................................................... 133
  p99: ......................................................................... 141.2
vusers.completed: .............................................................. 71
vusers.created: ................................................................ 70
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 70
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 18.7
  max: ......................................................................... 823.2
  mean: ........................................................................ 81.6
  median: ...................................................................... 27.9
  p95: ......................................................................... 539.2
  p99: ......................................................................... 742.6


All VUs finished. Total time: 21 seconds

--------------------------------
Summary report @ 20:17:08(+0000)
--------------------------------

http.codes.200: ................................................................ 600
http.downloaded_bytes: ......................................................... 64134
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 9019
  mean: ........................................................................ 522.3
  median: ...................................................................... 13.9
  p95: ......................................................................... 4231.1
  p99: ......................................................................... 7407.5
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 9019
  mean: ........................................................................ 522.3
  median: ...................................................................... 13.9
  p95: ......................................................................... 4231.1
  p99: ......................................................................... 7407.5
http.responses: ................................................................ 600
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.200: ................... 200
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  200
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  200
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 8
  max: ......................................................................... 9019
  mean: ........................................................................ 1478.8
  median: ...................................................................... 27.9
  p95: ......................................................................... 6702.6
  p99: ......................................................................... 8186.6
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 4
  max: ......................................................................... 364
  mean: ........................................................................ 47.1
  median: ...................................................................... 10.1
  p95: ......................................................................... 228.2
  p99: ......................................................................... 242.3
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 3
  max: ......................................................................... 308
  mean: ........................................................................ 40.9
  median: ...................................................................... 8.9
  p95: ......................................................................... 228.2
  p99: ......................................................................... 284.3
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 18.7
  max: ......................................................................... 9158.7
  mean: ........................................................................ 1572.5
  median: ...................................................................... 59.7
  p95: ......................................................................... 6838
  p99: ......................................................................... 8186.6

==================================================

Running upload_shorts.yaml on http://127.0.0.1:8080/tukano-1/rest
Test run id: tw5ht_8qgjmfk97kakdp4jha4yfc4h99eg4_geme
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 20:17:10(+0000)

Phase completed: Warm up (index: 0, duration: 10s) 20:17:21(+0000)

Phase started: Main test (index: 1, duration: 30s) 20:17:21(+0000)

--------------------------------------
Metrics for period to: 20:17:20(+0000) (width: 7.159s)
--------------------------------------

http.codes.200: ................................................................ 9
http.codes.204: ................................................................ 9
http.downloaded_bytes: ......................................................... 3691
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 29
http.response_time:
  min: ......................................................................... 5
  max: ......................................................................... 97
  mean: ........................................................................ 45.6
  median: ...................................................................... 47.9
  p95: ......................................................................... 94.6
  p99: ......................................................................... 94.6
http.response_time.2xx:
  min: ......................................................................... 5
  max: ......................................................................... 97
  mean: ........................................................................ 45.6
  median: ...................................................................... 47.9
  p95: ......................................................................... 94.6
  p99: ......................................................................... 94.6
http.responses: ................................................................ 18
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.204: ...... 9
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 5
  max: ......................................................................... 97
  mean: ........................................................................ 50
  median: ...................................................................... 48.9
  p95: ......................................................................... 55.2
  p99: ......................................................................... 55.2
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 10
  max: ......................................................................... 94
  mean: ........................................................................ 41.2
  median: ...................................................................... 22.9
  p95: ......................................................................... 71.5
  p99: ......................................................................... 71.5
vusers.completed: .............................................................. 9
vusers.created: ................................................................ 20
vusers.created_by_name.Upload short: ........................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 73.9
  max: ......................................................................... 238.3
  mean: ........................................................................ 121.2
  median: ...................................................................... 102.5
  p95: ......................................................................... 153
  p99: ......................................................................... 153


--------------------------------------
Metrics for period to: 20:17:30(+0000) (width: 9.507s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 11
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 91
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  11
vusers.created: ................................................................ 91
vusers.created_by_name.Upload short: ........................................... 91
vusers.failed: ................................................................. 11


--------------------------------------
Metrics for period to: 20:17:40(+0000) (width: 9.503s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 91
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  91
vusers.created: ................................................................ 100
vusers.created_by_name.Upload short: ........................................... 100
vusers.failed: ................................................................. 91


Phase completed: Main test (index: 1, duration: 30s) 20:17:51(+0000)

--------------------------------------
Metrics for period to: 20:17:50(+0000) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 100
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  100
vusers.created: ................................................................ 100
vusers.created_by_name.Upload short: ........................................... 100
vusers.failed: ................................................................. 100


--------------------------------------
Metrics for period to: 20:18:00(+0000) (width: 9.502s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 100
http.request_rate: ............................................................. 19/sec
http.requests: ................................................................. 19
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  100
vusers.created: ................................................................ 19
vusers.created_by_name.Upload short: ........................................... 19
vusers.failed: ................................................................. 100


--------------------------------------
Metrics for period to: 20:18:10(+0000) (width: 1.361s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 19
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  19
vusers.failed: ................................................................. 19


All VUs finished. Total time: 50 seconds

--------------------------------
Summary report @ 20:18:02(+0000)
--------------------------------

errors.ETIMEDOUT: .............................................................. 321
http.codes.200: ................................................................ 9
http.codes.204: ................................................................ 9
http.downloaded_bytes: ......................................................... 3691
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 339
http.response_time:
  min: ......................................................................... 5
  max: ......................................................................... 97
  mean: ........................................................................ 45.6
  median: ...................................................................... 47.9
  p95: ......................................................................... 94.6
  p99: ......................................................................... 94.6
http.response_time.2xx:
  min: ......................................................................... 5
  max: ......................................................................... 97
  mean: ........................................................................ 45.6
  median: ...................................................................... 47.9
  p95: ......................................................................... 94.6
  p99: ......................................................................... 94.6
http.responses: ................................................................ 18
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.204: ...... 9
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  9
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  321
plugins.metrics-by-endpoint.response_time./tukano-1/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 5
  max: ......................................................................... 97
  mean: ........................................................................ 50
  median: ...................................................................... 48.9
  p95: ......................................................................... 55.2
  p99: ......................................................................... 55.2
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 10
  max: ......................................................................... 94
  mean: ........................................................................ 41.2
  median: ...................................................................... 22.9
  p95: ......................................................................... 71.5
  p99: ......................................................................... 71.5
vusers.completed: .............................................................. 9
vusers.created: ................................................................ 330
vusers.created_by_name.Upload short: ........................................... 330
vusers.failed: ................................................................. 321
vusers.session_length:
  min: ......................................................................... 73.9
  max: ......................................................................... 238.3
  mean: ........................................................................ 121.2
  median: ...................................................................... 102.5
  p95: ......................................................................... 153
  p99: ......................................................................... 153

==================================================

Running realistic_flow.yaml on http://127.0.0.1:8080/tukano-1/rest
Test run id: th897_y9m9dfgc6qrrht4p9che5m5r4zcgm_r37j
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 20:18:04(+0000)

Phase completed: Warm up (index: 0, duration: 10s) 20:18:14(+0000)

Phase started: Main test (index: 1, duration: 30s) 20:18:14(+0000)

--------------------------------------
Metrics for period to: 20:18:10(+0000) (width: 4.118s)
--------------------------------------

http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 9
vusers.created: ................................................................ 9
vusers.created_by_name.Download short: ......................................... 1
vusers.created_by_name.Follow user: ............................................ 1
vusers.created_by_name.Get User Follows: ....................................... 2
vusers.created_by_name.Get User's Shorts: ...................................... 1
vusers.created_by_name.View feed: .............................................. 4


--------------------------------------
Metrics for period to: 20:18:20(+0000) (width: 9.424s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 9
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 71
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}.errors.ETIME...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/feed?pwd={{ p...  4
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/followers?pwd...  2
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/shorts.errors...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId1 }}/{{ userId2 }...  1
vusers.created: ................................................................ 71
vusers.created_by_name.Download short: ......................................... 20
vusers.created_by_name.Follow user: ............................................ 5
vusers.created_by_name.Get Short Likes: ........................................ 2
vusers.created_by_name.Get User's Shorts: ...................................... 9
vusers.created_by_name.Like short: ............................................. 8
vusers.created_by_name.Register user: .......................................... 1
vusers.created_by_name.Upload short: ........................................... 2
vusers.created_by_name.View feed: .............................................. 24
vusers.failed: ................................................................. 9


--------------------------------------
Metrics for period to: 20:18:30(+0000) (width: 9.922s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 71
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}.errors.ETIME...  20
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/likes?pwd={{...  2
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/{{ userId }}...  8
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/feed?pwd={{ p...  24
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/shorts.errors...  9
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  2
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId1 }}/{{ userId2 }...  5
plugins.metrics-by-endpoint./tukano-1/rest/users/.errors.ETIMEDOUT: ............ 1
vusers.created: ................................................................ 100
vusers.created_by_name.Download short: ......................................... 22
vusers.created_by_name.Follow user: ............................................ 8
vusers.created_by_name.Get Short Likes: ........................................ 3
vusers.created_by_name.Get User Follows: ....................................... 4
vusers.created_by_name.Get User's Shorts: ...................................... 8
vusers.created_by_name.Like short: ............................................. 6
vusers.created_by_name.Register user: .......................................... 3
vusers.created_by_name.Upload short: ........................................... 1
vusers.created_by_name.View feed: .............................................. 45
vusers.failed: ................................................................. 71


Phase completed: Main test (index: 1, duration: 30s) 20:18:44(+0000)

--------------------------------------
Metrics for period to: 20:18:40(+0000) (width: 9.921s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 100
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}.errors.ETIME...  22
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/likes?pwd={{...  3
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/{{ userId }}...  6
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/feed?pwd={{ p...  45
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/followers?pwd...  4
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/shorts.errors...  8
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId1 }}/{{ userId2 }...  8
plugins.metrics-by-endpoint./tukano-1/rest/users/.errors.ETIMEDOUT: ............ 3
vusers.created: ................................................................ 100
vusers.created_by_name.Download short: ......................................... 28
vusers.created_by_name.Follow user: ............................................ 6
vusers.created_by_name.Get Short Likes: ........................................ 4
vusers.created_by_name.Get User Follows: ....................................... 1
vusers.created_by_name.Get User's Shorts: ...................................... 11
vusers.created_by_name.Like short: ............................................. 7
vusers.created_by_name.Register user: .......................................... 2
vusers.created_by_name.Upload short: ........................................... 2
vusers.created_by_name.View feed: .............................................. 39
vusers.failed: ................................................................. 100


--------------------------------------
Metrics for period to: 20:18:50(+0000) (width: 9.922s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 100
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 50
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}.errors.ETIME...  28
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/likes?pwd={{...  4
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/{{ userId }}...  7
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/feed?pwd={{ p...  39
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/followers?pwd...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/shorts.errors...  11
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  2
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId1 }}/{{ userId2 }...  6
plugins.metrics-by-endpoint./tukano-1/rest/users/.errors.ETIMEDOUT: ............ 2
vusers.created: ................................................................ 50
vusers.created_by_name.Download short: ......................................... 9
vusers.created_by_name.Follow user: ............................................ 3
vusers.created_by_name.Get Short Likes: ........................................ 1
vusers.created_by_name.Get User's Shorts: ...................................... 6
vusers.created_by_name.Like short: ............................................. 8
vusers.created_by_name.Register user: .......................................... 2
vusers.created_by_name.View feed: .............................................. 21
vusers.failed: ................................................................. 100


--------------------------------------
Metrics for period to: 20:19:00(+0000) (width: 4.922s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 50
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}.errors.ETIME...  9
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/likes?pwd={{...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/{{ userId }}...  8
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/feed?pwd={{ p...  21
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/shorts.errors...  6
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId1 }}/{{ userId2 }...  3
plugins.metrics-by-endpoint./tukano-1/rest/users/.errors.ETIMEDOUT: ............ 2
vusers.failed: ................................................................. 50


All VUs finished. Total time: 50 seconds

--------------------------------
Summary report @ 20:18:55(+0000)
--------------------------------

errors.ETIMEDOUT: .............................................................. 330
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 330
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}.errors.ETIME...  80
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/likes?pwd={{...  10
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ shortId }}/{{ userId }}...  29
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/feed?pwd={{ p...  133
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/followers?pwd...  7
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}/shorts.errors...  35
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  5
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId1 }}/{{ userId2 }...  23
plugins.metrics-by-endpoint./tukano-1/rest/users/.errors.ETIMEDOUT: ............ 8
vusers.created: ................................................................ 330
vusers.created_by_name.Download short: ......................................... 80
vusers.created_by_name.Follow user: ............................................ 23
vusers.created_by_name.Get Short Likes: ........................................ 10
vusers.created_by_name.Get User Follows: ....................................... 7
vusers.created_by_name.Get User's Shorts: ...................................... 35
vusers.created_by_name.Like short: ............................................. 29
vusers.created_by_name.Register user: .......................................... 8
vusers.created_by_name.Upload short: ........................................... 5
vusers.created_by_name.View feed: .............................................. 133
vusers.failed: ................................................................. 330

==================================================

Running user_delete.yaml on http://127.0.0.1:8080/tukano-1/rest
Test run id: tn5qd_q6tb83mwywcnb8bexhp4rkybkme9r_hxn4
Phase started: simple_post (index: 0, duration: 20s) 20:18:57(+0000)

--------------------------------------
Metrics for period to: 20:19:00(+0000) (width: 2.4s)
--------------------------------------

http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 25
vusers.created: ................................................................ 25
vusers.created_by_name.TuKanoDeleteUserFlow: ................................... 25


--------------------------------------
Metrics for period to: 20:19:10(+0000) (width: 9.903s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 25
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.TuKanoDeleteUserFlow: ................................... 100
vusers.failed: ................................................................. 25


Phase completed: simple_post (index: 0, duration: 20s) 20:19:17(+0000)

--------------------------------------
Metrics for period to: 20:19:20(+0000) (width: 9.902s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 100
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 75
vusers.created: ................................................................ 75
vusers.created_by_name.TuKanoDeleteUserFlow: ................................... 75
vusers.failed: ................................................................. 100


--------------------------------------
Metrics for period to: 20:19:30(+0000) (width: 7.401s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 75
vusers.failed: ................................................................. 75


All VUs finished. Total time: 31 seconds

--------------------------------
Summary report @ 20:19:29(+0000)
--------------------------------

errors.ETIMEDOUT: .............................................................. 200
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.TuKanoDeleteUserFlow: ................................... 200
vusers.failed: ................................................................. 200

==================================================